bugtracker_api/app/controllers/users_controller.rb

INSERT INTO "users" ("lname", "fname", "email", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["lname", "test"], ["fname", "tes"], ["email", ""], ["created_at", "2020-04-01 19:14:23.094479"], ["updated_at", "2020-04-01 19:14:23.094479"]]
---
  def create
    @user = User.create!(user_params)

UPDATE "users" SET "fname" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["fname", "hello"], ["updated_at", "2020-04-01 21:48:10.287736"], ["id", 1]]
---
  def update
    @user.update(user_params)